---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CodeCheckingParameterService
source: html/d40c4e5b-7760-e222-4adb-b559599134f5.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CodeCheckingParameterService Property

The external service supporting view and modification of the structural code checking parameter in analytical elements.
 To use this service, programmers implement a server class that derives from ICodeCheckingParameterServer .

## Syntax (C#)
```csharp
public static ExternalServiceId CodeCheckingParameterService { get; }
```